#pragma once

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

// 의사 코드로 작성한 내용을 함수로 바로 표현하고 싶다.

// 상수를 사용하는 예제 코드를 만들어 봅니다.

// 맵의 최대 크기 제한 << 변수의 값만 변경하면 맵의 크기가 자동으로 변경되도록 만들고 싶다.

// 전역 변수 >> 맵의 크기
// 함수. 플레이어의 현재 위치 값이랑 맵의 최대 범위 비교해서 벗어 났으면 알림을 알리는 코드를 작성해보세요.

// 플레이어의 좌표를 x,y 표현
// 맵의 좌표를 x,y 표현
// 맵의 범위를 표현하는 함수를 만들어보세요.

// ex) 크기 : 10 (0.0) (규칙 : x 오른쪽이 양의 방향, y 아래 쪽이 양의 방향)
// checkPlayerIsBoundary() >> bool, true false <stdbool,h>
// 경계선을 어떻게 구하는데? >> CalculateBoundary(시작 좌표, 맵의 크기)


// if (플레이어가 경계선 안에 있나요?) { 플레이어가 x,y 좌표에 있습니다.}
// else if(그게 아니라면) {플레이어가 경계선 밖으로 나갔습니다} >> 플레이어가 움직이지마세요.

// 그러면 움직여라.